config.org
#+TITLE:  Zacque's Literate Emacs Config
#+AUTHOR: Lee Jia Hong
#+EMAIL:  jia_hong@live.com.my
#+DATE:   [2018-06-09 Sat]
#+TAGS:   literate emacs config dotfile noexport

* Introduction

This is an attempt to put my Emacs config into an org file. By doing so, my init.el file will contains only two lines of code:

#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el :results none
;;; init.el --- Where all the magic begins. -*- lexical-binding: t -*-

;;; COMMENTARY:
;;----------------------------------------------------------------------------
;;    ___ _ __ ___   __ _  ___ ___
;;   / _ \ '_ ` _ \ / _` |/ __/ __|
;;  |  __/ | | | | | (_| | (__\__ \
;; (_)___|_| |_| |_|\__,_|\___|___/
;;
;;  Citations
;;
;;     "Show me your ~/.emacs and I will tell you who you are."
;;                                                         [Bogdan Maryniuk]
;;
;;     "Emacs is like a laser guided missile. It only has to be slightly
;;      mis-configured to ruin your whole day."
;;                                                            [Sean McGrath]
;;
;;     "While any text editor can save your files, only Emacs can save your
;;      soul."
;;                                                          [Per Abrahamsen]
;;
;; Source: http://www.mygooglest.com/fni/dot-emacs.html
;;----------------------------------------------------------------------------

;;----------------------------------------------------------------------------
;;
;;                __   _,--="=--,_   __
;;               /  \."    .-.    "./  \
;;              /  ,/  _   : :   _  \/` \
;;              \  `| /o\  :_:  /o\ |\__/
;;               `-'| :="~` _ `~"=: |
;;                  \`     (_)     `/
;;           .-"-.   \      |      /   .-"-.
;;      .---{     }--|  /,.-'-.,\  |--{     }---.
;;       )  (_)_)_)  \_/`~-===-~`\_/  (_(_(_)  (
;;      (                                       )
;;       )          Recreating Purcell         (
;;      (            Emacs Experience           )
;;       )                                     (
;;      '---------------------------------------'
;;
;;----------------------------------------------------------------------------

;;; CODE:
;; SOURCE: https://github.com/jamiecollinson/dotfiles/blob/master/.emacs
(org-babel-load-file (concat user-emacs-directory "config.org"))

(provide 'init)
;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:

;;; init.el ends here
#+END_SRC

The rest is in the config.org file.

* Header

#+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t; -*-
#+END_SRC

* GC Tweaks

Emacs GC optimisation.

[Disabled] Knowing when the GC is running. 
[Reason] It's annoying to keep seeing the message popping up.
#+BEGIN_SRC emacs-lisp :tangle no
(setq garbage-collection-messages t)
#+END_SRC

Set GC threshold to 1GB.
#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold #x40000000)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defmacro k-time (&rest body)
  "Measure and return the time it takes evaluating BODY."
  `(let ((time (current-time)))
     ,@body
     (float-time (time-since time))))

;; When idle for 15sec run the GC no matter what.
(defvar k-gc-timer
  (run-with-idle-timer 15 t (lambda () (garbage-collect))))
#+END_SRC

References:
1. http://akrl.sdf.org/
   Emacs garbage collection magic hack
2. https://www.reddit.com/r/emacs/comments/cbyza2/emacs_slight_lag_allocate_more_ram_garbage/
   Where I found out about the "magic hack".

* Manage Packages and Sources
** Add Package Source

Add melpa as a package source.

#+BEGIN_SRC emacs-lisp
(require 'package)
;; (package-initialize)

(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
#+END_SRC

Load .el if newer than corresponding .elc.
#+BEGIN_SRC emacs-lisp
(setq load-prefer-newer t)
#+END_SRC

Auto download package info asynchronously on Emacs startup.
#+BEGIN_SRC emacs-lisp
(package-refresh-contents t)
#+END_SRC

Add third-party library from the ./lisp directory. This is especially useful if I clone the library from Github and work on it. Since all .el files reside in one level deep in lisp directory, I will need to add all the subdirectory to the load path.
#+BEGIN_SRC emacs-lisp
;; A helper function
;; Source: https://stackoverflow.com/a/17165074
(defun jh/directory-files (directory &optional full match nosort)
  "Retrieve the list of files and sub-directory in the DIRECTORY. Does not recurse into sub-directories. Like `directory-files' or ls command, but excluding \".\" and \"..\"."
  (let* ((files (directory-files directory full match nosort))
         (result files))
    (if full
        (progn
          (setq result (delete (concat directory "/.") result))
          (setq result (delete (concat directory "/..") result))
          result)
      (delete "." (delete ".." result)))))
#+END_SRC

With the helper function, =(jh/directory-files ~/.emacs.d/lisp)= should return a result containing all the directory in lisp as a list. With this, I will only need to loop through the list and add each subdirectory path to the =load-path=.

#+BEGIN_SRC emacs-lisp
(dolist (subdir (jh/directory-files "~/.emacs.d/lisp"))
  (add-to-list 'load-path (expand-file-name (concat "lisp/" subdir) user-emacs-directory)))
#+END_SRC

** ELPA Public Key

#+BEGIN_SRC emacs-lisp
;; Set GPG Directory for ELPA Public Key
(setq package-gnupghome-dir "~/.gnupg")
#+END_SRC

** Require-package
  
A code orginally taken from Purcell, but now modified to suit my need.
#+BEGIN_SRC emacs-lisp
(defun require-package (package)
  "Require a PACKAGE. Install PACKAGE if not already installed. PACKAGE will be required immediately after installation."
  (if (package-installed-p package)
      (require package)
    (unless package-archive-contents
      (package-refresh-contents))
    (package-install package)
    (require package)))
#+END_SRC

** External Program Dependencies

As my Emacs is tightly integrated with my OS (Arch Linux/Ubuntu), there are libraries that will not work if the executable is not found.

Check if an executable is installed.
#+BEGIN_SRC emacs-lisp
(defun check-executable-is-installed (exe &optional msg)
  "Check if an executable is installed."
  (unless (executable-find exe)
    (message (concat "'" exe "' not found. " msg))))
#+END_SRC

[TODO] If the executable is not installed, install them at Emacs boot up.
#+BEGIN_SRC emacs-lisp :tangle no

#+END_SRC

** list-packages

Open list-packages in fullframe.
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'fullframe
 (fullframe list-packages quit-window))
#+END_SRC

* Utility Third Library

** Fullframe

Display some windows into "full-screen" mode.
#+BEGIN_SRC emacs-lisp
(require-package 'fullframe)
#+END_SRC

** Page-Break_lines

Display ugly ^L page breaks as tidy horizontal lines.
#+BEGIN_SRC emacs-lisp
(require-package 'page-break-lines)
(global-page-break-lines-mode)

(with-eval-after-load 'diminish ;; diminish library is loaded after this line
  (diminish 'page-break-lines-mode))
#+END_SRC

** List-unicode-display

Provides a command which searches for unicode characters by name, and displays a list of matching characters with their names in a buffer.
#+BEGIN_SRC emacs-lisp
(require-package 'list-unicode-display)
#+END_SRC

** Diminish

A useful tool to hide/redefine mode indicator at the mode line.
#+BEGIN_SRC emacs-lisp
(require-package 'diminish)
#+END_SRC

** Wgrep

#+BEGIN_SRC emacs-lisp
(require-package 'wgrep)
#+END_SRC

** Ripgrep

rg is an Emacs interface to =ripgrep=. This package interoperates well with =wgrep=. Similar: =deadgrep=.
#+BEGIN_SRC emacs-lisp
(require-package 'rg)
(with-eval-after-load 'evil
  (evil-set-initial-state 'rg-mode 'emacs))
#+END_SRC

#+NAME: Ripgrep Package
#+BEGIN_SRC emacs-lisp
(require-package 'ripgrep) ;; for integration with projectile.
(with-eval-after-load 'evil
  (evil-set-initial-state 'ripgrep-search-mode 'emacs))
#+END_SRC

Use -i for case insensitive.
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'counsel
  (setq counsel-rg-base-command "rg -i --no-heading --line-number --color never %s"))
#+END_SRC

References:
1. https://oremacs.com/2018/03/05/grep-exclude/
   For counsel-rg-base-command idea.
2. https://github.com/dajva/rg.el

** Undo-Tree

Advanced undo and redo with =undo-tree=.
#+BEGIN_SRC emacs-lisp
(require-package 'undo-tree)
(diminish 'undo-tree-mode)

;; turn on everywhere
(global-undo-tree-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'evil
  (evil-set-initial-state 'undo-tree-visualizer-mode 'emacs))
#+END_SRC

** Restart-Emacs
A handy tool to restart emacs, especially when using EXWM.
#+BEGIN_SRC emacs-lisp
(require-package 'restart-emacs)
#+END_SRC

** Mode-Line-Bell

A useful tool to alert from the mode-line.
#+BEGIN_SRC emacs-lisp
(require-package 'mode-line-bell)
#+END_SRC

** Hydra

#+BEGIN_SRC emacs-lisp
(require-package 'hydra)
#+END_SRC

* Keeping Secrets in Emacs with GnuPG and Auth Sources

Emacs offers to save my passwords when I want to use TRAMP. However, I would like to save it in an encrypted file. Create the file =~/.authinfo.gpg= and give only the current user permission to read-write to it.
#+BEGIN_SRC shell
chmod 600 ~/.emacs.d/.authinfo.gpg
#+END_SRC

Set it to use =gpg= explicitly (it is the default). In some case, I might want to use =gpg2=.
#+BEGIN_SRC emacs-lisp
(setq epg-gpg-program "gpg2")
#+END_SRC

Save my credential inside this self-defined file in .emacs.d dir.
#+BEGIN_SRC emacs-lisp
(setq auth-sources '((:source "~/.emacs.d/.authinfo.gpg")))
#+END_SRC

gpg2 runs the pinentry app for password prompt. Use Emacs for the prompt. 
#+BEGIN_SRC emacs-lisp
(setq epg-pinentry-mode 'loopback)
#+END_SRC

Echo a lot of additional, helpful information to the *Messages* buffer.
#+BEGIN_SRC emacs-lisp
(setq auth-source-debug t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'evil
  (evil-set-initial-state 'epa-key-mode 'emacs)
  (evil-set-initial-state 'epa-key-list-mode 'emacs))
#+END_SRC

Managing secrets in Emacs. =password-store= exposes API that can be used to fetch secrets from my local .password-store.
#+BEGIN_SRC emacs-lisp
(require-package 'password-store)
#+END_SRC

References:
1. https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources
2. https://emacs.stackexchange.com/a/32554
   epg-pinentry-mode

* Personal Info

** Name and Email

Add my personal info.
#+BEGIN_SRC emacs-lisp
(setq user-full-name (password-store-get-field "personal-info" "fullname"))
(setq user-mail-address (password-store-get-field "personal-info" "personal-hotmail"))
#+END_SRC

** Emacs-memento-mori

A reminder of mortality. Deep dive into the reflection of life.

#+BEGIN_SRC emacs-lisp
(require-package 'memento-mori)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq memento-mori-birth-date (password-store-get-field "personal-info" "birthday"))
(memento-mori-mode)
#+END_SRC

References:
1. http://manuel-uberti.github.io//emacs/2019/07/06/memento-mori/
   Where I read about it.

** Sync directory

I used to using Dropbox for syncing. But after I realise that Dropbox limits Free User account to syncing three accounts, I decided to switch to Nextcloud. Here I define the directory for syncing.
#+BEGIN_SRC emacs-lisp
(defconst jh/sync-directory "/home/zacque/Dropbox/DropSyncFiles")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun jh/file-in-sync-directory (&rest SEQUENCES)
  "Return full path to FILE in the sync-directory as defined by jh/sync-directory. Extra arguments are concatenated to the path. E.g. (jh/file-in-sync-directory SUB-DIR \"file.org\") returns path to jh/sync-directory+SUB-DIR+file.org."
  (mapconcat 'identity (push jh/sync-directory SEQUENCES) "/"))
#+END_SRC

* Personalise & Aesthetic

#+BEGIN_SRC emacs-lisp
;; UI Settings
(setq inhibit-startup-screen t)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(menu-bar-mode -1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
(add-hook 'after-init-hook 'mode-line-bell-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-visual-line-mode 1) ;; wrap line
(with-eval-after-load 'diminish  ;; diminish library is loaded after this line
  (diminish 'visual-line-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Make sure C-v and M-v returns cursor to the same position.

#+BEGIN_SRC emacs-lisp
(setq scroll-preserve-screen-position 'always)
#+END_SRC

** Setup my Emacs.d Structure

Configure my directory location.

#+BEGIN_SRC emacs-lisp
(defconst jh/emacs-directory (concat (getenv "HOME") "/.emacs.d/"))
(defun jh/emacs-subdirectory (d) (expand-file-name d jh/emacs-directory))
#+END_SRC

Create directory if not already created. Got the code from [[https://github.com/howardabrams/dot-files/blob/master/emacs.org#directory-structure][here]].

#+BEGIN_SRC emacs-lisp
(let* ((subdirs '("lisp" "backups" "themes"))
       (fulldirs (mapcar (lambda (d) (jh/emacs-subdirectory d)) subdirs)))
  (dolist (dir fulldirs)
    (when (not (file-exists-p dir))
      (message "Make directory: %s" dir)
      (make-directory dir))))
#+END_SRC

*** Move the Custom Variables into a Dedicated File

To prevent custom variable form cluttering the init.el file.
#+BEGIN_SRC emacs-lisp
(defconst custom-file "~/.emacs.d/custom.el")
(unless (file-exists-p custom-file)
  (shell-command (concat "touch " custom-file)))
(setq custom-file custom-file)
(load custom-file)
#+END_SRC

*** Define the Backup Directory
  
#+BEGIN_SRC emacs-lisp
;; Sensible Backups
(setq backup-directory-alist '(("." . "~/.emacs.d/backups"))
      backup-by-copying t       ; Don't delink hardlinks
      version-control t         ; Use version numbers on backups
      delete-old-versions t     ; Automatically delete excess backups
      kept-new-versions 20      ; Number of newest versions to keep
      kept-old-versions 5       ; Number of the old versions to keep
      vc-make-backup-files t)   ; Make backups file even from a version controlled dir
#+END_SRC

** All-the-icons

#+BEGIN_SRC emacs-lisp
(require-package 'all-the-icons)
#+END_SRC

Remember to run (all-the-icons-install-fonts) to install the Resource Fonts. Bear in mind, this will run =fc-cache -f -v= which can take some time to complete.

References:
1. github:domtronn/all-the-iocns.el

