config.org
** ebib

I discover that ~ivy-bibtex~ works with ~ebib~.
#+BEGIN_SRC emacs-lisp
(require-package 'ebib)
#+END_SRC

Launch ~ebib~ in evil-emacs-state.
#+BEGIN_SRC emacs-lisp
(evil-set-initial-state 'ebib-index-mode 'emacs)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq ebib-file-search-dirs '(""))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (setq ebib-preload-bib-files bibtex-completion-bibliography)
(setq ebib-preload-bib-files (list "/home/zacque/Documents/Artificial_Intelligence/references.bib" "/home/zacque/Documents/bibliography/references.bib" "/home/zacque/Documents/Artificial_Intelligence/academic_papers/computer_vision/references.bib" "/home/zacque/Documents/Artificial_Intelligence/academic_papers/instance_segmentation/references.bib" "/home/zacque/Documents/Artificial_Intelligence/academic_papers/video_understanding/references.bib"))
#+END_SRC

Load the provided ~org~ebib~ package to provide org-mode integration. E.g. ebib org-link-type.
#+BEGIN_SRC emacs-lisp
(require 'org-ebib)
#+END_SRC

*** Archived                                                     :noexport:
:PROPERTIES:
:header-args: :tangle no
:END:

[Archived] Integrate ebib link to org-mode.
Status: Archived
Reason: Load the provided ~org-ebib~ package will do.
#+BEGIN_SRC emacs-lisp
(org-add-link-type "ebib" 'ebib)
#+END_SRC

References:
1. https://stackoverflow.com/a/14984481
   Add org link type.

** Org-ref

=org-ref= is an Emacs library/org-mode modules for citations, cross-references, bibliographies and other useful bibtext tools.

#+BEGIN_SRC emacs-lisp
(setq org-ref-completion-library 'org-ref-ivy-cite)
#+END_SRC

This matches the APA citation style that I usually use.
#+BEGIN_SRC emacs-lisp
(setq org-ref-default-citation-link "Citep")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq reftex-default-bibliography
      '("~/Documents/bibliography/references.bib"
        "~/Documents/Artificial_Intelligence/references.bib"))
#+END_SRC

Not quite sure the differences between these and the =reftex-default-bibliography= variable.
#+BEGIN_SRC emacs-lisp
(setq org-ref-bibliography-notes "~/Documents/bibliography/notes.txt"
      org-ref-default-bibliography reftex-default-bibliography
      org-ref-pdf-directory "~/Documents/bibliography/pdfs/")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'org-ref)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun jh/add-bib-to-org-ref ()
  "Add the current .bib file to org-ref."
  (interactive)
  (unless (buffer-file-name)
    (error "No file is being viewed."))
  (add-to-list 'org-ref-default-bibliography (buffer-file-name)))
#+END_SRC

To open org pdf link with Emacs pdf tools. Reference: https://github.com/jkitchin/org-ref/issues/184#issuecomment-303553448
#+BEGIN_SRC emacs-lisp
(setq org-file-apps 
      '((auto-mode . emacs)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . emacs)))
#+END_SRC

To compile LaTeX document with citations:
#+BEGIN_SRC emacs-lisp
(setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-latex-logfiles-extensions  '("lof" "lot" "tex" "aux" "idx" "log" "out" "toc" "nav" "snm" "vrb" "dvi" "fdb_latexmk" "blg" "brf" "fls" "entoc" "ps" "spl" "bbl" "pygtex" "pygstyle"))
#+END_SRC

#+Source: https://tex.stackexchange.com/a/372988
#+BEGIN_SRC emacs-lisp
(setq tex-run-command "pdftex")
(setq tex-bibtex-command "biber")
(setq latex-run-command "pdflatex")
#+END_SRC

#+RESULTS: https://tex.stackexchange.com/a/372988
: pdflatex

References:
1. https://nickgeorge.net/science/org_ref_setup/
** Arxiv

Load the library to enable arxiv org-link support, e.g. arxiv:0801.1144.
#+BEGIN_SRC emacs-lisp
(require 'org-ref-arxiv)
#+END_SRC

References:
1. http://kitchingroup.cheme.cmu.edu/blog/2015/03/09/Bibtex-Entries-from-Arxiv-org/

* Projectile Mode

A package for project management and navigation.
#+BEGIN_SRC emacs-lisp
(require-package 'projectile)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-p") 'projectile-command-map)

;; Shorter modeline
(setq-default projectile-mode-line-prefix " Proj")
(setq projectile-completion-system 'ivy)
(projectile-mode +1)
#+END_SRC

Extra:
1. [[Ripgrep Package][Integration with Ripgrep Package]]
   Install the ripgrep package.

Note:
1. Check out counsel-projectile package for customisation code guidance.

Customisation idea:
1. Use rg search by default, coupled with ivy completing system.

* SQL Database

Emacs has a built-in SQL suite that includes SQL highlighting and SQL consoles for all major players: SQL mode and a function =sql-ms= that can connect to a database.

It depends on the =osql= and =isql= program. This can be installed on Ubuntu.
#+BEGIN_SRC sh :dir /sudo::
sudo apt install freetds-bin unixodbc
#+END_SRC

* Enable Yasnippet Templating

=Yasnippet= is a templating tool to save boilerplate typing, such as a file header. It is very powerful and the template can even be defined dynamically.
#+BEGIN_SRC emacs-lisp
(require-package 'yasnippet)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(yas-reload-all)
(diminish 'yas-minor-mode  " Ⓨ")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(dolist (hook '(text-mode-hook prog-mode-hook))
  (add-hook hook 'yas-minor-mode))
#+END_SRC

* GNU Global

#+BEGIN_SRC emacs-lisp
(require-package 'ggtags)
#+END_SRC

* Org Literate Programming/ Org-babel/ Ox-babel

#+BEGIN_SRC emacs-lisp
(setq org-confirm-babel-evaluate nil)
(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
#+END_SRC

Disabling default source code block indentation by 2 spaces (relative to the #+BEGIN_SRC and #+END_SRC lines) makes direct editing much easier [fn:11].
#+BEGIN_SRC emacs-lisp
(setq org-edit-src-content-indentation 0)
#+END_SRC

Edit org-src-code on the other window, instead of force organising all the frame into two side-by-side window.
#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'other-window)
#+END_SRC

Use org template system to generate source blocks.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist '("es" "#+BEGIN_SRC emacs-lisp?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist '("py" "#+BEGIN_SRC python\n?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist '("sh" "#+BEGIN_SRC shell\n?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist '("jp" "#+BEGIN_SRC jupyter-python\n?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist '("di" "#+BEGIN_SRC ditaa :file ?.png :cmdline -r -s 0.8\n\n#+END_SRC"))
(add-to-list 'org-structure-template-alist '("dot" "#+BEGIN_SRC dot :file ?.png :cmdline -Kdot -Tpng\n\n#+END_SRC"))
(add-to-list 'org-structure-template-alist '("pl" "#+BEGIN_SRC plantuml :file ?.png \n\n#+END_SRC"))
#+END_SRC

Instead of replace the file content on every tangle, use this to append code to the file.
#+BEGIN_SRC emacs-lisp :tangle no
;; SOURCE: https://emacs.stackexchange.com/a/38898
(defun org-babel-tangle-append ()
  "Append source code block at point to its tangle file.
   The command works like `org-babel-tangle' with prefix arg
   but `delete-file' is ignored."
  (interactive)
  (cl-letf (((symbol-function 'delete-file) #'ignore))
    (org-babel-tangle '(4))))
(add-hook 'org-mode-hook #'org-babel-tangle-append)
#+END_SRC

Auto-display generated image after each execution. This is especially useful for ob-jupyter, ob-ditaa, Graphviz and PlantUML. Source: https://github.com/dzop/emacs-jupyter/issues/178
#+BEGIN_SRC emacs-lisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
#+END_SRC

** ob-async

Run ob-babel asynchronously. I hope this could be the default behaviour?
#+BEGIN_SRC emacs-lisp
(require-package 'ob-async)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq ob-async-no-async-languages-alist '("jupyter-python" "jupyter-julia"))
#+END_SRC

Note:
1. The package does not support :session header-arg for now. See github:astahlman/ob-async#1.

References:
1. github:astahlman/ob-async

** emacs-jupyter

*** System Setup
:PROPERTIES:
:header-args: :tangle no
:END:

Prerequisite:
#+BEGIN_SRC shell :dir /sudo::
apt-get install -y python3-ipykernel
#+END_SRC

#+BEGIN_SRC shell :dir /sudo::
pip3 install ipykernel
#+END_SRC

#+BEGIN_SRC shell :dir /sudo::
python3 -m ipykternel.kernelspec
#+END_SRC

#+RESULTS:
: Installed kernelspec python3 in /usr/local/share/jupyter/kernels/python3

Edit kernel.json file to using python3.
#+BEGIN_SRC shell
jupyter kernelspec list
#+END_SRC

Refresh Emacs Jupyter config if necessary.
#+BEGIN_SRC emacs-lisp
(jupyter-available-kernelspecs t)
#+END_SRC

*** Connect to remote kernel
:PROPERTIES:
:header-args: :tangle no
:END:

#+BEGIN_SRC shell
jupyter kernel --kernel=python3
#+END_SRC

*** Emacs Setup

#+BEGIN_SRC emacs-lisp
(require-package 'jupyter)
#+END_SRC

** Load all babel

List the supported language for org-babel.
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   (ditaa . t)
   (dot . t)
   (emacs-lisp . t)
   (gnuplot . t)
   (haskell . nil)
   (latex . t)
   (ledger . t)
   (ocaml . nil)
   (octave . t)
   (plantuml . t)
   (python . t)
   (ruby . t)
   (screen . nil)
   (shell . t)
   (sql . nil)
   (sqlite . t)
   (scheme . t)
   (C . t)
   (jupyter . t))) ;; jupyter should be the last
#+END_SRC

* Parentheses Fun

A section about parentheses and lisp modes in general. Might deal with parens, quotes,and mode.

#+BEGIN_SRC emacs-lisp
(setq show-paren-delay 0)
#+END_SRC

Activate this mode (globally?) to highlight matching parenthsis.
#+BEGIN_SRC emacs-lisp
(show-paren-mode t)
#+END_SRC

Reference: https://emacs.stackexchange.com/q/28857 and https://stackoverflow.com/q/27142996
#+BEGIN_SRC emacs-lisp
;; Purcell .emacs.d
(when (fboundp 'electric-pair-mode)
  (add-hook 'after-init-hook 'electric-pair-mode)
  (setq electric-pair-preserve-balance nil))
#+END_SRC

** Rainbow-Delimiters

#+BEGIN_SRC emacs-lisp
(require-package 'rainbow-delimiters)
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+END_SRC

** Paredit

A mode that enables AST transformation.
#+BEGIN_SRC emacs-lisp
(require-package 'paredit)
(diminish 'paredit " Par")
#+END_SRC

** Lispy Hooks

Check parens on save. Taken from Purcell.
#+BEGIN_SRC emacs-lisp
(defun jh/enable-check-parens-on-save ()
  "Run `check-parens' when the current buffer is saved."
  (add-hook 'after-save-hook #'check-parens nil t))
#+END_SRC

Adapt evil-args to lisp. 
Issues: 
1. Have to consider the spaces in strings.
2. Have to consider arguments between newline characters as well. (applied to c-modes)
#+NAME: evil-lisp-args
#+BEGIN_SRC emacs-lisp
(defun jh/evil-args-switch-to-lisp-mode ()
  "Switch evil-args parameters to adapt to lisp-modes."
  (setq evil-args-delimiters '(" ")))
#+END_SRC

Define all hooks to run in all Lisp modes based on Purcell's config.
#+BEGIN_SRC emacs-lisp
(defvar jh/lispy-modes-hook
  '(jh/enable-check-parens-on-save
    jh/evil-args-switch-to-lisp-mode
    enable-paredit-mode
    aggressive-indent-mode)
  "Define all hooks to run in all Lisp modes.")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun jh/lisp-setup()
  "Enable features useful in all Lisp modes."
  (run-hooks 'jh/lispy-modes-hook))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defconst jh/lispy-modes
  '(lisp-mode lisp-interaction-mode inferior-lisp-mode
              emacs-lisp-mode common-lisp-mode geiser-mode)
  "All lisp modes.")
#+END_SRC

An in-built Elisp library.
#+BEGIN_SRC emacs-lisp
(require 'derived)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(dolist (hook (mapcar #'derived-mode-hook-name jh/lispy-modes))
  (add-hook hook 'jh/lisp-setup))
#+END_SRC

* Emacs Lisp

Taken from Purcell. This package might prettier elisp expessions output.
#+BEGIN_SRC emacs-lisp
(require-package 'ipretty)
(add-hook 'after-init-hook 'ipretty-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'highlight-quoted)
(add-hook 'emacs-lisp-mode-hook 'highlight-quoted-mode)
#+END_SRC

Kill the debugger windows on exit.
#+BEGIN_SRC emacs-lisp
(setq debugger-bury-or-kill 'kill)
#+END_SRC

* Enable Geiser Mode
  
The official website is here [fn:7]. 
#+BEGIN_SRC emacs-lisp
(require-package 'geiser)
#+END_SRC
  
Set guile as the default choice. No need to ask for confirmation everytime.
#+BEGIN_SRC emacs-lisp
(setq geiser-active-implementations '(guile))
#+END_SRC

Configure org-tangle to export scheme file to end with .scm. By default, it ends with .scheme extension.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-babel-tangle-lang-exts '("scheme" . "scm"))
#+END_SRC

* Enable Web-Mode

#+BEGIN_SRC emacs-lisp
(require-package 'web-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq web-mode-enable-current-element-highlight t)
#+END_SRC

This web-mode uses =evil-matchit= package to jump between closing and opening HTML tags.

* Enable PHP-Mode

#+BEGIN_SRC emacs-lisp
(require-package 'php-mode)
#+END_SRC

* Enable Python-Mode

On Ubuntu, use Python3 by default.
#+BEGIN_SRC emacs-lisp
(setq python-shell-interpreter "python3")
#+END_SRC

In Ubuntu, set org-babel to run =python3= by default.
#+BEGIN_SRC emacs-lisp
(setq org-babel-python-command "python3")
#+END_SRC

** Highlight Indentation

Enable highlight indentation globally.
#+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook 'highlight-indentation-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'highlight-indentation
  (diminish 'highlight-indentation-mode))
#+END_SRC

** Pip-mode

It supports =*.pip= and =requirements*.txt= files. It provides syntax highlighting, togglable comments, and auto-completion of package names from PyPI.

#+BEGIN_SRC emacs-lisp
(require-package 'pip-requirements)
#+END_SRC

[Workaround] Not sure why the mode does not auto-detect "requirements.txt" file.
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("requirements.txt" . pip-requirements-mode))
#+END_SRC

References:
1. https://github.com/Wilfred/pip-requirements.el

** Elpy

Elpy turns Emacs into a Python IDE. Getting ideas from these sources [fn:9].
#+BEGIN_SRC emacs-lisp
(require-package 'elpy) ;; Python IDE features
#+END_SRC

It relies on =Jedi= for backend introspection and analysis of Python sources. Jedi is known to have problems coping with badly-formatted Python.
#+BEGIN_SRC shell :dir /sudo::
pip install jedi flake8
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq elpy-rpc-python-command "python3")
(setq elpy-rpc-virtualenv-path 'current)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun jh/--enable-elpy ()
  (elpy-enable))
(add-hook 'python-mode-hook #'jh/--enable-elpy)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-key elpy-mode-map [remap elpy-shell-kill-all] nil)
#+END_SRC

These are packages that work well with Elpy:
1. flycheck (as the Flymake alternative)
   #+BEGIN_SRC emacs-lisp
   (when (require 'flycheck nil t)
       (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
       (add-hook 'elpy-mode-hook 'flycheck-mode))
   #+END_SRC

2. py-autopep8
   #+BEGIN_SRC emacs-lisp
   (require-package 'py-autopep8)
   (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)
   #+END_SRC

3. ein (Ipython/Jupyter integration)
   #+BEGIN_SRC emacs-lisp :tangle no
   (elpy-use-ipython)
   #+END_SRC

Error: elpy-use-ipython is deprecated; see https://elpy.readthedocs.io/en/latest/ide.html#interpreter-setup

** Jupyter

To use Emacs with Jupyter, check out =emacs-jupyter=, =ob-ipython=, and =ein=.

* Enable YAML Mode

This is useful to edit =docker-compose.yml= file.
#+BEGIN_SRC emacs-lisp
;; YAML Mode
(require-package 'yaml-mode)
(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))

(add-hook 'yaml-mode-hook
	  '(lambda ()
	     (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
#+END_SRC

