config.org
** Readable YAML

To make YAML readable:
1. Highlight indentation.
   #+BEGIN_SRC emacs-lisp
   (add-hook 'yaml-mode-hook 'highlight-indentation-mode)
   #+END_SRC
   Refer to: [[*Highlight Indentation][Highlight Indentation in Python Mode]]

2. Folds all code on an higher indentation level to view the outline.
   #+BEGIN_SRC emacs-lisp
   ;; Source: https://stackoverflow.com/a/4459159
   (defun aj-toggle-fold (&optional arg)
     "Toggle fold all lines larger than indentation on current line"
     (interactive)
     (let ((col 1))
       (save-excursion
         (back-to-indentation)
         (setq col (+ 1 (current-column)))
         (set-selective-display
          (if selective-display nil (or col 1))))))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
   (defun evil-yaml-mode ()
     "Override default evil key bindings for yaml mode."
     (evil-define-key 'normal yaml-mode-map
       "za" 'aj-toogle-fold))

   (add-hook 'yaml-mode-hook 'evil-yaml-mode)
   #+END_SRC

References:
1. https://blog.chmouel.com/2016/09/07/dealing-with-yaml-in-emacs/

* Enable Rust-Mode

#+BEGIN_SRC emacs-lisp
(require-package 'rust-mode)
#+END_SRC

Automatic runs =rust-format-buffer= during saves. By default, it is bound to =C-c C-f=.
#+BEGIN_SRC emacs-lisp
(setq rust-format-on-save t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'flycheck-rust)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
#+END_SRC

** Ob-Rust

[Prerequisite] Install =rust=, =cargo=, and =cargo-script=.
#+BEGIN_SRC shell
cargo install cargo-script
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'ob-rust)
#+END_SRC

* Enable Groovy Mode for Gradle

Gradle is Groovy DSL.

#+BEGIN_SRC emacs-lisp
(require-package 'groovy-mode)
#+END_SRC

** Define a derived gradle-mode
:PROPERTIES:
:header-args: :tangle ./lisp/gradle-mode/gradle-mode.el
:END:

Derive and define gradle-mode from groovy-mode. Note: This code will be tangled to the lisp dir.
#+BEGIN_SRC emacs-lisp
;;; gradle-mode.el --- An emacs major mode for editing gradle files.

;; Copyright (C) 2019  Lee Jia Hong

;; Author: Lee Jia Hong
;; Keywords: languages
;; Version: 0.0.1

;; Licensed under the Apache License, Version 2.0 (the "License");
;; you may not use this file except in compliance with the License.
;; You may obtain a copy of the License at
;;
;;     http://www.apache.org/licenses/LICENSE-2.0
;;
;; Unless required by applicable law or agreed to in writing, software
;; distributed under the License is distributed on an "AS IS" BASIS,
;; WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
;; See the License for the specific language governing permissions and
;; limitations under the License.

;;; Commentary:

;; A mode for editing gradle files.
;;

;;; Code:
(require 'groovy-mode)

(defvar gradle-constants '())

(defvar gradle-keywords '())

(defvar gradle-tab-width 4 "Width for a tab for gradle mode")

(defvar gradle-font-lock-defaults '(()))

(add-to-list 'auto-mode-alist '("\.gradle$" . gradle-mode))

(define-derived-mode gradle-mode groovy-mode "Gradle mode"
  "Gradle mode is a major mode for editing gradle file"
  (setq font-lock-defaults groovy-font-lock-keywords)

  (when gradle-tab-width
    (setq tab-width gradle-tab-width))

  (setq comment-start "//")
  (setq comment-end "")
)

(provide 'gradle-mode)
;;; gradle-mode.el ends here
#+END_SRC

** Gradle-mode

#+BEGIN_SRC emacs-lisp :tangle no
(require 'gradle-mode)
#+END_SRC

* Enable BNF-Mode

For editing BNF grammars.
#+BEGIN_SRC emacs-lisp
(require-package 'bnf-mode)
#+END_SRC

References:
1. https://github.com/sergeyklay/bnf-mode

* Enable ini-mode

#+BEGIN_SRC emacs-lisp
(require 'ini-mode)
(add-to-list 'auto-mode-alist '("\\.ini\\'" . ini-mode))
#+END_SRC

References:
1. https://github.com/Lindydancer/ini-mode

* Enable toml-mode

#+BEGIN_SRC emacs-lisp
(require-package 'toml-mode)
#+END_SRC

* Graphviz and PlantUML

** Graphviz

#+BEGIN_SRC emacs-lisp
(require-package 'graphviz-dot-mode)
#+END_SRC

** PlantUML

#+BEGIN_SRC emacs-lisp
(require-package 'plantuml-mode)
#+END_SRC

#+SOURCE: Purcell .emacs.d
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'ob-plantuml
  (let ((jar-name "plantuml.jar")
        (url "http://jaist.dl.sourceforge.net/project/plantuml/plantuml.jar"))
    (setq org-plantuml-jar-path (expand-file-name jar-name (file-name-directory user-init-file)))
    (unless (file-exists-p org-plantuml-jar-path)
      (url-copy-file url org-plantuml-jar-path))))
#+END_SRC

** Ditaa

#+BEGIN_SRC emacs-lisp
(setq org-ditaa-jar-path (jh/emacs-subdirectory "ditaa.jar"))
#+END_SRC

#+RESULTS:
: /home/zacque/.emacs.d/ditaa.jar

* Docker -- Containers

Surprisingly, there are Emacs packages that offer a nice integration with Docker to help manage containers. 

=docker= package offers a Magit-like hydra menu to handle images and containers from Emacs. =dockerfile-mode= offers syntax highlighting when editing Dockerfiles. =docker-tramp= allows me to connect via TRAMP to the insides of a container and do whatever I need there.

#+BEGIN_SRC emacs-lisp
(require-package 'docker)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq docker-command "/usr/bin/docker")
#+END_SRC

Make =evil= works well with =docker= mode.
#+BEGIN_SRC emacs-lisp
(evil-set-initial-state 'docker-container-mode 'emacs)
(evil-set-initial-state 'docker-network-mode 'emacs)
(evil-set-initial-state 'docker-image-mode 'emacs)
#+END_SRC

Since I didn't add my user to the Docker group, I will need to run every docker command with =sudo=. Setting this flag will make it work. [fn:17]
#+BEGIN_SRC emacs-lisp
(setq docker-run-as-root nil)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'dockerfile-mode)
(add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'docker-compose-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(fullframe docker-images tablist-quit)
(fullframe docker-machines tablist-quit)
(fullframe docker-volumes tablist-quit)
(fullframe docker-networks tablist-quit)
(fullframe docker-containers tablist-quit)
#+END_SRC

Map <RET> to a key to show all options. By default, pressing <RET> does nothing, which is unintuitive to me.
#+BEGIN_SRC emacs-lisp
(define-key docker-container-mode-map (kbd "RET") 'docker-container-help-popup)
#+END_SRC

* Magit -- Git Client

** Magit 

#+BEGIN_SRC emacs-lisp
(require-package 'magit)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(fullframe magit-status magit-mode-quit-window)
#+END_SRC

** Forge -- Working with GitHub and GitLab

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'magit
  (require-package 'forge))
#+END_SRC

* Eglot -- LSP Client

Eglot is a Language Server Protocol(LSP) server client. It has default integration with flymake and is aiming to be integrated into Emacs.
#+BEGIN_SRC emacs-lisp
(require-package 'eglot)
#+END_SRC

Automatically shutdown Eglot after the last managed buffer is killed. Checkout: github:joaotavora/eglot#305
#+BEGIN_SRC emacs-lisp
(setq eglot-autoshutdown t)
#+END_SRC

Currently, I have installed Python Language Server [fn:21] and Rust Language Server [fn:22]. Autorun =eglot= when visiting these buffers.
#+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook 'eglot-ensure)
(add-hook 'rust-mode-hook 'eglot-ensure)
#+END_SRC

* Restclient for Testing API

#+BEGIN_SRC emacs-lisp
(require-package 'restclient)
(require-package 'ob-restclient)
#+END_SRC

Load org-babel for restclient. 
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages '((restclient . t)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'company-restclient)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-to-list 'company-backends 'company-restclient)
#+END_SRC

* Terraform

Major mode for terraform configuration file.
#+BEGIN_SRC emacs-lisp
(require-package 'terraform-mode)
#+END_SRC

Company backend for terraform files.
#+BEGIN_SRC emacs-lisp
(require-package 'company-terraform)
(company-terraform-init)
#+END_SRC

References:
1. https://github.com/syohex/emacs-terraform-mode
2. https://github.com/rafalcieslak/emacs-company-terraform

** Archived                  :noexport:
:PROPERTIES:
:header-args: :tangle no
:END:

*** Terraform-doc

[Archived] Lookup docs from Terraform homepage.
Reason: Replace by dash docs.
#+BEGIN_SRC emacs-lisp
(require-package 'terraform-doc)
#+END_SRC

References: 
1. https://github.com/TxGVNN/terraform-doc

* Writing Experience

** Writing in Chinese Pinyin

Writing in Chinese pinyin [fn:18]. Use =set-input-method= to switch between languages. Use =toggle-input-method= to easily switch back.
#+BEGIN_SRC emacs-lisp
(require-package 'pyim)
(require 'pyim)
#+END_SRC

Pinyin dictionary for =pyim= package.
#+BEGIN_SRC emacs-lisp
(require-package 'pyim-basedict)
(pyim-basedict-enable)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq pyim-dicts `((:name "hugedict" :file ,(jh/emacs-subdirectory "pyim/dict/pyim-bigdict.pyim"))))
#+END_SRC

Use "pyim" as default input method. Then I can invoke =toggle-input-method= anywhere to type Chinese.
#+BEGIN_SRC emacs-lisp
(setq default-input-method "pyim")
#+END_SRC

** Spelling Checker (Flyspell-mode)

Flyspell-mode is a built-in package with Emacs.
#+BEGIN_SRC emacs-lisp
(require 'flyspell)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook #'flyspell-mode)
#+END_SRC

I prefer British spelling to US spelling.
#+BEGIN_SRC emacs-lisp
(setq ispell-dictionary "british-ise")
#+END_SRC

Remove the default "M-TAB" binding to flyspell-auto-correct-word. Currently, I am using it for pcomplete.
#+BEGIN_SRC emacs-lisp
(define-key flyspell-mode-map (kbd "C-M-i") nil)
#+END_SRC

** Whitespace Alignment

Source: http://pragmaticemacs.com/emacs/aligning-text/
#+BEGIN_SRC emacs-lisp
(defun jh/align-whitespace (start end)
  "Align columns by whitespace."
  (interactive "r")
  (align-regexp start end "\\(\\s-*\\)\\s-" 1 0 t))
#+END_SRC

* Managing System Services

Managing system services through Emacs.
#+BEGIN_SRC emacs-lisp
(require-package 'daemons)

(evil-set-initial-state 'daemons-mode 'emacs)
(evil-set-initial-state 'daemons-output-mode 'emacs)

(fullframe daemons quit-window)
#+END_SRC

* Emacs Buffers

** ibuffer

#+BEGIN_SRC emacs-lisp
(require 'ibuffer)
#+END_SRC

ibuffer is an in-built package. Use ibuffer to manage buffer.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(fullframe ibuffer ibuffer-quit)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; Use human readable Size column instead of original one
(define-ibuffer-column size-h
  (:name "Size" :inline t)
  (file-size-human-readable (buffer-size)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; Modify the default ibuffer-formats (toggle with `)
(setq ibuffer-formats
      '((mark modified read-only vc-status-mini " "
              (name 22 22 :left :elide)
              " "
              (size-h 9 -1 :right)
              " "
              (mode 12 12 :left :elide)
              " "
              vc-relative-file)
        (mark modified read-only vc-status-mini " "
              (name 22 22 :left :elide)
              " "
              (size-h 9 -1 :right)
              " "
              (mode 14 14 :left :elide)
              " "
              (vc-status 12 12 :left)
              " "
              vc-relative-file)))
#+END_SRC


#+BEGIN_SRC emacs-lisp
(setq ibuffer-filter-group-name-face 'font-lock-doc-face)
#+END_SRC

** ibuffer-vc

Group buffers by vc root directory.
#+BEGIN_SRC emacs-lisp
(require-package 'ibuffer-vc)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun ibuffer-set-up-preferred-filters ()
  (ibuffer-vc-set-filter-groups-by-vc-root)
  (unless (eq ibuffer-sorting-mode 'filename/process)
    (ibuffer-do-sort-by-filename/process)))

(add-hook 'ibuffer-hook 'ibuffer-set-up-preferred-filters)
#+END_SRC

* Emacs Windows

** ace-window

Quick switching between buffer windows.
#+BEGIN_SRC emacs-lisp
(require-package 'ace-window)
(ace-window-display-mode 1) ;; show keys in the modeline
(global-set-key [remap other-window] 'ace-window)
#+END_SRC

** Hydra -- tying it all

#+BEGIN_SRC emacs-lisp
(defhydra hydra-window-z ()
  "Hydra-window"
  ("h" windmove-left)
  ("j" windmove-down)
  ("k" windmove-up)
  ("l" windmove-right)

  ("H" buf-move-left)
  ("J" buf-move-down)
  ("K" buf-move-up)
  ("L" buf-move-right)

  ("1" ace-window "ace")
  ("s" (lambda () (interactive) (ace-window 4)) "swap")
  ("d" (lambda () (interactive) (ace-window 16)) "delete")

  ("|" (lambda ()
	 (interactive)
	 (split-window-right)
	 (windmove-right)))
  ("-" (lambda ()
	 (interactive)
	 (split-window-below)
	 (windmove-down)))
  ("u" (progn
	 (winner-undo)
	 (setq this-command 'winner-undo)))
  ("f" counsel-find-file)
  ("r" winner-redo)
  ("d" delete-window))

(global-set-key (kbd "<f1>") 'hydra-window-z/body)
#+END_SRC

References:
1. https://www.reddit.com/r/emacs/comments/8of6tx/tip_how_to_be_a_beast_with_hydra/e059v1z/
2. https://oremacs.com/2015/01/29/more-hydra-goodness/
   Combining ace-window and windmove with hydra.

* EXWM -- Use Emacs as a Window Manager

** Basic Setup

#+BEGIN_SRC emacs-lisp
(require-package 'exwm)
(require 'exwm-config)
#+END_SRC

Show all EXWM buffers in all workspaces.
#+BEGIN_SRC emacs-lisp
(setq exwm-workspace-show-all-buffers t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq exwm-layout-show-all-buffers t)
#+END_SRC

Able to resize non-floating buffer with mouse.
#+BEGIN_SRC emacs-lisp
(window-divider-mode)
#+END_SRC

** Utils

#+BEGIN_SRC emacs-lisp
(defun switch-to-last-buffer ()
  "Switch to last open buffer in current window."
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

(exwm-input-set-key (kbd "s-<tab>") #'switch-to-last-buffer)
#+END_SRC

